Tekla Open API Reference for Tekla Structures 2025
AnalysisBar.Curvature Property
 Gets or sets the curvature of the analysis bar.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisCurvature Curvature { get; set; }
Public Property Curvature As AnalysisCurvature
	Get
	Set
Property Value
Type: AnalysisCurvature
See Also
Reference
AnalysisBar Class
Tekla.Structures.Analysis Namespace